---
author: akira
lang: ja
date: 2013-04-18 01:21:30+00:00
layout: post
title: 小説を２倍に拡大表示してくれる「吾輩の小説」のコードを公開
tags:
- 開発
---

昔のSF/推理小説がスマホで読めないと死んでしまう akiraak です。

そんな自分のために作ったiPhoneアプリ「吾輩の小説」がありました。既存のビュワーでは小説を画面に表示すると文字が小さくて読みづらいんですね。そこで作ったのが画像を２倍に拡大して表示するアプリです。行の真ん中で折り返すので、上下スクロールは必要なく、横スクロールの操作だけで読めます。

[
吾輩の小説
![](http://a1.mzstatic.com/us/r1000/024/Purple/cd/d6/d3/mzi.hrstfcin.175x175-75.jpg)
]({{ site.data.apps.mynovel.url }})

今回、こちらのコードをgithubに公開しました。
[GitHub: akiraak/novel2x](https://github.com/akiraak/novel2x)

技術的には画像のピクセルを解析して、行・文字を識別し、１行の半分で折り返して画面に表示するというものです。

このような画像を

![](http://farm9.staticflickr.com/8104/8659665410_9b00d1e4de_c.jpg)

行と文字を識別し

![](http://farm9.staticflickr.com/8112/8659665360_f7d78c028e_c.jpg)

行の半ばで折り返して拡大表示します。

![](http://farm9.staticflickr.com/8121/8659665374_2c23d7d611_c.jpg)

４年ほどテスト（読みたい小説を読んでいるだけともいう）を行なってきましたが、９５％以上の割合で綺麗に表示されます。テストした書籍はこちらになります。





  * 1Q84-2


  * 1Q84-3


  * 1Q84-BOOK1-村上春樹


  * 2001年宇宙の旅


  * moon palace


  * アイの物語


  * アルジャーノンに花束を


  * アンドロイドは電気羊の夢を見るか？


  * エデン-近藤史恵


  * オー！ファザー-伊坂幸太郎


  * オーディンの鴉


  * オタクの息子に悩んでいます


  * ガダラの豚1


  * ガニメデの優しい巨人


  * グーグルネット覇者の真実


  * グレイトフル・デッドにマーケティングを学ぶ


  * これから「正義」の話をしよう


  * サクリファイス-近藤史恵


  * ジェノサイド


  * シャードー８１


  * そして誰もいなくなった


  * ソフィーの世界


  * タイタンの妖女


  * タイムリープ(下)-高畑京一郎


  * タイムリープ(上)-高畑京一郎


  * パーマー・エルドリッチの三つの聖痕


  * パプリカ


  * プリンセス・トヨトミ


  * ふわふわの泉


  * むかし僕が死んだ家


  * レベル７


  * ロートレック荘事件


  * 阿修羅ガール


  * 一九八四


  * 黄金の王・白銀の王


  * 下町ロケット


  * 華氏451度


  * 楽しい地獄旅行


  * 巨人たちの星


  * 銀河ヒッチハイク・ガイド


  * 向日葵の咲かない夏


  * 考え方の整頓


  * 殺戮にいたる病ー我孫子武丸


  * 十字架-重松清


  * 銃・病原菌・鉄（下）


  * 銃・病原菌・鉄（上）


  * 小説の読み方の教科書


  * 笑わない数学者-森博嗣


  * 新世界より（下）


  * 新世界より（上）


  * 新世界より（中）


  * 神様のカルテ


  * 人形館の殺人


  * 政治家の殺し方


  * 星の舞台からみてる


  * 星を継ぐもの


  * 禅銃


  * 体制維新-大阪都


  * 哲学入門


  * 天の筏


  * 天才数学者はこう儲ける


  * 天地明察


  * 天冥の標１


  * 怒りのダンス


  * 内藤忍の資産設計塾


  * 猫のゆりかご


  * 猫を抱いて象と泳ぐ


  * 白きたおやかな峰


  * 白の闇


  * 僕の妹は感じが読める


  * 木曜の男


  * 幼年期の終り


  * 葉桜の季節に君を想うということ


  * 藝人春秋



冒頭で昔のSFが好きと書きましたが、なんだかんだで「アイの物語」の一番好きです。古典も良いですが最新のSFもよく出来ていますね。

それはさておき、興味があればどうぞ。
[GitHub: akiraak/novel2x](https://github.com/akiraak/novel2x)

もっと読みやすい小説ビューワーが生まれる事を願って。
